#include <GyverLBUF.h>
GyverLBUF<int, 8> buf;
// тип данных: любой. byte/int/float...
// размер буфера: код выполняется быстрее при
// размере буфера, кратном степени двойки (2, 4, 8, 16, 32...)

void setup() {
  Serial.begin(9600);

  for (int i = 0; i < 12; i++) {
    buf.write(i);
    for (int j = 0; j < 8; j++) {
      Serial.print(buf.read(j));
      Serial.print(',');
    }
    Serial.println();
  }

  /*
    0,0,0,0,0,0,0,0,
    0,0,0,0,0,0,0,1,
    0,0,0,0,0,0,1,2,
    0,0,0,0,0,1,2,3,
    0,0,0,0,1,2,3,4,
    0,0,0,1,2,3,4,5,
    0,0,1,2,3,4,5,6,
    0,1,2,3,4,5,6,7,
    1,2,3,4,5,6,7,8,
    2,3,4,5,6,7,8,9,
    3,4,5,6,7,8,9,10,
    4,5,6,7,8,9,10,11,
  */
}

void loop() {
}
